In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({"name":['john',"alice","bob","diana"],"Age":[28,34,23,29],"dept":["HR","IT","Marketing","Finance"],"Salary":[45000,60000,35000,50000]})
df.head

<bound method NDFrame.head of     name  Age       dept  Salary
0   john   28         HR   45000
1  alice   34         IT   60000
2    bob   23  Marketing   35000
3  diana   29    Finance   50000>

In [3]:
df[:2]

    name  Age dept  Salary
0   john   28   HR   45000
1  alice   34   IT   60000

In [10]:
df["Bonus"]=df["Salary"] * 0.5

In [11]:
df["Salary"].mean

<bound method Series.mean of 0    45000
1    60000
2    35000
3    50000
Name: Salary, dtype: int64>

In [14]:
df[df["Age"]>=25]

    name  Age     dept  Salary    Bonus
0   john   28       HR   45000  22500.0
1  alice   34       IT   60000  30000.0
3  diana   29  Finance   50000  25000.0